#+Title 为了适应自己想做的网站 对这个项目进行部分修改
网站用户:
admin:admin
test:qazxcvbn
test2:qazxcvbn
数据库:
djangoblog:hello
******* TODO 继续研究表格:插件
:LOGBOOK:
CLOCK: [2020-10-31 六 15:40]--[2020-10-31 六 15:51] =>  0:11
CLOCK: [2020-10-31 六 09:54]--[2020-10-31 六 10:00] =>  0:06
:END:
http://vitalets.github.io/x-editable/docs.html

   1. 指标
      1. 丰富的编辑功能
         1. 一般要求
            1. 点击编辑
            2. 删除
            3. 修改
            4. 添加
         2. 进阶要求
            1. 对顺序的优化
               1. 一种可能是 拖动
               2. 一种可能是 重新定义排序
               3. 一种可能是 能够操作都是针对每行的
      2.
   2. [ ] 插件
   3. [ ] 试一试别人写的代码
      1. [ ] js

      2. [ ] html
******** TODO 按键部分的功能:删除
:LOGBOOK:
CLOCK: [2020-10-31 六 09:43]--[2020-10-31 六 09:54] =>  0:11
:END:
1. [X] 实验删除语句的效果 :tabProduct
   1. [X] 删除i=1 是有效的  删除了 有效内容的第一行
      #+BEGIN_SRC javascript
  tabProduct.deleteRow(1);

      #+END_SRC
2. [C] 实验删除语句的效果 :传递参数 没问题
   1. [ ] 删除i=1
   2. [ ] 删除i=2
   3. [ ] 删除i=3
3. [-] 修改功能代码部分
   1. [-] 逆向思考
      1. [-] 在菜鸟上自己测试程序 完成内容

         1. [-] 点击按键 检测checkbox
            1. [-] 先试试获得checkbox的方法

               1. [X] 抄袭  表格的代码

               2. [X] 抄袭 内容的代码

               3. [ ] 测试
         2. [ ] 点击按键 删除特定行
            #+BEGIN_SRC javascript
      //可以参考的代码
      <input type="checkbox" id="test" class="test">同意
      <script>
          // 获取checkbox元素
          var box=document.getElementById("test");
          // 判断是否被拒选中，选中返回true，未选中返回false
          alert(box.checked);
      </script>


      //他用的代码
      <td align="center" bgcolor="#FFFFFF"><input type="checkbox" name="checkbox2" value="checkbox" /></td>


            #+END_SRC
   2. [ ] 顺向思考

      1. [ ] 如何判断 checkbox被选中了

      2. [ ] table里的checkbox
4. [ ] 测试
